<template>
  <div>
    <div class="container-fluid bg_rules_color">
      <v-container class="c__container d-flex flex-column justify-content-center gap-10 align-items-end h_100">
      <span class="irandyekanM w__light text-right d-block">
      قوانین و مقررات
    </span>
        <h1 class="irandyekanBB-24 d-block text-right">
          شرایط استفاده از وب‌سایت ایراسن
        </h1>
      </v-container>
    </div>
    <v-container class="c__container">
      <v-col v-for="item in rulesData" :key="item.id">
        <h3 class="irandyekanBB18 text-right">
          {{item.title}}
        </h3>
        <p class="irandyekanM text-right w__light irandyekanMLine-1-8 mt-4">
          {{item.desc}}
        </p>
        div
        <v-divider></v-divider>
      </v-col>
    </v-container>
  </div>
</template>

<script lang="ts">
import {Component , Vue} from "nuxt-property-decorator";
@Component
export default class Rules extends Vue{
  rulesData : any = [
    {
      title : 'عنوان اول قوانین و مقررات و شرایط استفاده' ,
      desc : 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود.'
    } ,
    {
      title : 'عنوان دوم شرایط استفاده' ,
      desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود.'
    } ,
    {
      title : 'عنوان سوم قوانین و مقررات و شرایط استفاده' ,
      desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود.'
    } ,
    {
      title : 'عنوان چهارم شرایط استفاده' ,
      desc: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای.'
    } ,
  ]
}
</script>

<style>
.bg_rules_color{
  background:  #F6F6FC;
  position: relative;
  height: 164px;
}
.w__light{
  color: #4E4E68 !important;
}
.h_100{
  height: 100%;
}
</style>
